
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      StataNow 19.5
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2025 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-782-8272        https://www.stata.com
                                   979-696-4600        service@stata.com

Stata license: Unlimited-user 2-core network, expiring  8 Jun 2026
Serial number: 501909302568
  Licensed to: Anzony QUISPE ROJAS
               

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do test_hdfe_local.do 

. *****************************************************************************
> ***
. * Test file for hdfe() option in did_multiplegt_dyn
. * This file uses the LOCAL modified version of the ado file
. *****************************************************************************
> ***
. 
. clear all

. set seed 12345

. set more off

. 
. * IMPORTANT: Use the local modified version of the ado file
. * First, drop any existing program definition
. cap program drop did_multiplegt_dyn

. cap program drop did_multiplegt_dyn_core_new

. 
. * Load the local version
. adopath ++ "/Users/anzony.quisperojas/Documents/GitHub/did_multiplegt_dyn/Sta
> ta"
  [1]              "/Users/anzony.quisperojas/Documents/GitHub/did_multiplegt_d
> yn/Stata"
  [2]  (BASE)      "/Applications/StataNow/ado/base/"
  [3]  (SITE)      "/Applications/StataNow/ado/site/"
  [4]              "."
  [5]  (PERSONAL)  "/Users/anzony.quisperojas/Documents/Stata/ado/personal/"
  [6]  (PLUS)      "/Users/anzony.quisperojas/Library/Application Support/Stata
> /ado/plus/"
  [7]  (OLDPLACE)  "~/ado/"

. 
. * Verify we're using the local version
. which did_multiplegt_dyn
/Users/anzony.quisperojas/Documents/GitHub/did_multiplegt_dyn/Stata/did_multipl
> egt_dyn.ado

. 
. * Check if reghdfe is installed
. cap which reghdfe

. if _rc {
.     ssc install reghdfe, replace
. }

. 
. * Check if ftools is installed (required by reghdfe)
. cap which ftools

. if _rc {
.     ssc install ftools, replace
. }

. 
. *****************************************************************************
> ***
. * 1. Generate Synthetic Panel Data with Fixed Effects
. *****************************************************************************
> ***
. 
. * Parameters
. local N_groups = 500        // Number of groups (e.g., firms)

. local T_periods = 10        // Number of time periods

. local N_industries = 50     // Number of industries (high-dimensional FE)

. local N_regions = 20        // Number of regions

. 
. * Create panel structure
. set obs `=`N_groups' * `T_periods''
Number of observations (_N) was 0, now 5,000.

. gen group = ceil(_n / `T_periods')

. bysort group: gen time = _n

. 
. * Assign time-invariant characteristics to groups
. bysort group: gen industry = ceil(runiform() * `N_industries') if _n == 1
(4,500 missing values generated)

. bysort group: replace industry = industry[1]
(4500 real changes made)

. 
. bysort group: gen region = ceil(runiform() * `N_regions') if _n == 1
(4,500 missing values generated)

. bysort group: replace region = region[1]
(4500 real changes made)

. 
. * Generate treatment timing (staggered adoption)
. bysort group: gen treat_time = . if _n == 1
(5,000 missing values generated)

. bysort group: replace treat_time = ceil(runiform() * (`T_periods' + 3)) if _n
>  == 1
(500 real changes made)

. bysort group: replace treat_time = treat_time[1]
(4500 real changes made)

. replace treat_time = . if treat_time > `T_periods'
(1,100 real changes made, 1,100 to missing)

. 
. * Create treatment indicator
. gen D = (time >= treat_time) & treat_time != .

. 
. * Generate fixed effects
. * Industry fixed effects (time-invariant within industry)
. gen industry_fe = 0

. forvalues i = 1/`N_industries' {
  2.     replace industry_fe = rnormal(0, 2) if industry == `i' & group == grou
> p[1]
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(10 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. bysort industry: replace industry_fe = industry_fe[1]
(10 real changes made)

. 
. * Region fixed effects
. gen region_fe = 0

. forvalues r = 1/`N_regions' {
  2.     replace region_fe = rnormal(0, 1.5) if region == `r' & group == group[
> 1]
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(10 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. bysort region: replace region_fe = region_fe[1]
(10 real changes made)

. 
. * Time fixed effects
. gen time_fe = 0

. forvalues t = 1/`T_periods' {
  2.     replace time_fe = rnormal(0, 1) if time == `t' & _n == `t'
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. bysort time: replace time_fe = time_fe[1]
(0 real changes made)

. 
. * Group fixed effects (unit-specific intercepts)
. bysort group: gen group_fe = rnormal(0, 3) if _n == 1
(4,500 missing values generated)

. bysort group: replace group_fe = group_fe[1]
(4500 real changes made)

. 
. * True treatment effect
. local true_att = 2.5

. 
. * Generate outcome
. gen Y = group_fe + time_fe + industry_fe + region_fe + `true_att' * D + rnorm
> al(0, 1)

. 
. di ""


. di "=========================================="
==========================================

. di "SYNTHETIC DATA SUMMARY"
SYNTHETIC DATA SUMMARY

. di "=========================================="
==========================================

. di "Number of groups: `N_groups'"
Number of groups: 500

. di "Time periods: `T_periods'"
Time periods: 10

. di "Number of industries: `N_industries'"
Number of industries: 50

. di "Number of regions: `N_regions'"
Number of regions: 20

. di "True ATT: `true_att'"
True ATT: 2.5

. di ""


. 
. tab D

          D |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,878       57.56       57.56
          1 |      2,122       42.44      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. sum Y D industry region

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           Y |      5,000    .9930655    3.349901  -11.00008   12.18992
           D |      5,000       .4244     .494301          0          1
    industry |      5,000       24.83    14.52884          1         50
      region |      5,000       10.47    5.752888          1         20

. 
. *****************************************************************************
> ***
. * 2. Prepare dummy variables for controls() approach
. *****************************************************************************
> ***
. 
. * Create industry dummies interacted with time
. tab industry, gen(ind_)

   industry |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        110        2.20        2.20
          2 |         90        1.80        4.00
          3 |        100        2.00        6.00
          4 |         90        1.80        7.80
          5 |        180        3.60       11.40
          6 |         90        1.80       13.20
          7 |         80        1.60       14.80
          8 |        100        2.00       16.80
          9 |        100        2.00       18.80
         10 |        160        3.20       22.00
         11 |         90        1.80       23.80
         12 |        100        2.00       25.80
         13 |         60        1.20       27.00
         14 |        110        2.20       29.20
         15 |        120        2.40       31.60
         16 |         80        1.60       33.20
         17 |         70        1.40       34.60
         18 |        150        3.00       37.60
         19 |         90        1.80       39.40
         20 |         70        1.40       40.80
         21 |        190        3.80       44.60
         22 |        170        3.40       48.00
         23 |        100        2.00       50.00
         24 |         80        1.60       51.60
         25 |         90        1.80       53.40
         26 |         90        1.80       55.20
         27 |        100        2.00       57.20
         28 |         80        1.60       58.80
         29 |        120        2.40       61.20
         30 |        120        2.40       63.60
         31 |         50        1.00       64.60
         32 |         70        1.40       66.00
         33 |        110        2.20       68.20
         34 |        110        2.20       70.40
         35 |        120        2.40       72.80
         36 |         70        1.40       74.20
         37 |         70        1.40       75.60
         38 |         90        1.80       77.40
         39 |         70        1.40       78.80
         40 |        100        2.00       80.80
         41 |         60        1.20       82.00
         42 |         70        1.40       83.40
         43 |         70        1.40       84.80
         44 |        120        2.40       87.20
         45 |        110        2.20       89.40
         46 |         90        1.80       91.20
         47 |        110        2.20       93.40
         48 |         90        1.80       95.20
         49 |        140        2.80       98.00
         50 |        100        2.00      100.00
------------+-----------------------------------
      Total |      5,000      100.00

. 
. forvalues i = 1/`N_industries' {
  2.     gen ind_time_`i' = ind_`i' * time
  3. }

. 
. * Use subset for controls
. local controls_subset ""

. forvalues i = 1/20 {
  2.     local controls_subset "`controls_subset' ind_time_`i'"
  3. }

. 
. *****************************************************************************
> ***
. * 3. Test ORIGINAL approach: controls() with FE dummies
. *****************************************************************************
> ***
. 
. di ""


. di "=========================================="
==========================================

. di "TEST 1: ORIGINAL APPROACH"
TEST 1: ORIGINAL APPROACH

. di "Using controls() with industry x time dummies"
Using controls() with industry x time dummies

. di "=========================================="
==========================================

. 
. timer clear 1

. timer on 1

. 
. cap noi did_multiplegt_dyn Y group time D, effects(3) placebo(2) controls(`co
> ntrols_subset') cluster(group) graph_off


-------------------------------------------------------------------------------
> -
             Estimation of treatment effects: Event-study effects
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
    Effect_1 |  2.539966    .082659   2.377957   2.701974       2768 
    Effect_2 |  2.573544    .085858   2.405265   2.741822       2313 
    Effect_3 |  2.443992    .102801   2.242505   2.645478       1888 

             | Switchers 
-------------+----------
    Effect_1 |       350 
    Effect_2 |       311 
    Effect_3 |       274 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the effects : p-value = 0


-------------------------------------------------------------------------------
> -
               Average cumulative (total) effect per treatment unit
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
  Av_tot_eff |  2.523009   .0746279   2.376741   2.669277       3353 

             |    Switch  x Periods 
-------------+---------------------
  Av_tot_eff |       935            
-------------------------------------------------------------------------------
> -
Average number of time periods over which a treatment's effect is accumulated =
>  1.9187166


-------------------------------------------------------------------------------
> -
          Testing the parallel trends and no anticipation assumptions
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
   Placebo_1 |  .0676394   .0807368  -.0906019   .2258807       2308 
   Placebo_2 | -.0463213     .09758  -.2375746   .1449319       1500 

             | Switchers 
-------------+----------
   Placebo_1 |       306 
   Placebo_2 |       239 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the placebos : p-value = .54566961


The development of this package was funded by the European Union (ERC, REALLYCR
> EDIBLE,GA N°101043899).

. 
. timer off 1

. timer list 1
   1:      5.21 /        1 =       5.2050

. 
. * Store results
. matrix results_controls = J(5,1,.)

. if _rc == 0 {
.     matrix results_controls[1,1] = e(effect_1)
.     matrix results_controls[2,1] = e(se_effect_1)
.     matrix results_controls[3,1] = e(placebo_1)
.     matrix results_controls[4,1] = e(placebo_2)
.     matrix results_controls[5,1] = 1  // success flag
. }

. else {
.     matrix results_controls[5,1] = 0
. }

. 
. *****************************************************************************
> ***
. * 4. Test NEW approach: hdfe() option
. *****************************************************************************
> ***
. 
. di ""


. di "=========================================="
==========================================

. di "TEST 2: NEW APPROACH"
TEST 2: NEW APPROACH

. di "Using hdfe() with industry"
Using hdfe() with industry

. di "=========================================="
==========================================

. 
. timer clear 2

. timer on 2

. 
. cap noi did_multiplegt_dyn Y group time D, effects(3) placebo(2) hdfe(industr
> y) cluster(group) graph_off
Warning: HDFE residualization could not be performed for baseline treatment lev
> el 1. Using original outcome.

High-dimensional fixed effects absorbed using reghdfe for variables: industry



-------------------------------------------------------------------------------
> -
             Estimation of treatment effects: Event-study effects
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
    Effect_1 |  2.531353   .0819844   2.370667    2.69204       2768 
    Effect_2 |  2.552059   .0837743   2.387864   2.716254       2313 
    Effect_3 |  2.403033   .0969697   2.212976    2.59309       1888 

             | Switchers 
-------------+----------
    Effect_1 |       350 
    Effect_2 |       311 
    Effect_3 |       274 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the effects : p-value = 0


-------------------------------------------------------------------------------
> -
               Average cumulative (total) effect per treatment unit
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
  Av_tot_eff |  2.500636    .071794   2.359923    2.64135       3353 

             |    Switch  x Periods 
-------------+---------------------
  Av_tot_eff |       935            
-------------------------------------------------------------------------------
> -
Average number of time periods over which a treatment's effect is accumulated =
>  1.9187166


-------------------------------------------------------------------------------
> -
          Testing the parallel trends and no anticipation assumptions
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
   Placebo_1 |  .0743222   .0811303  -.0846904   .2333348       2308 
   Placebo_2 | -.0234486   .0990029  -.2174908   .1705936       1500 

             | Switchers 
-------------+----------
   Placebo_1 |       306 
   Placebo_2 |       239 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the placebos : p-value = .57983819


The development of this package was funded by the European Union (ERC, REALLYCR
> EDIBLE,GA N°101043899).

. 
. timer off 2

. timer list 2
   2:      0.88 /        1 =       0.8840

. 
. * Store results
. matrix results_hdfe = J(5,1,.)

. if _rc == 0 {
.     matrix results_hdfe[1,1] = e(effect_1)
.     matrix results_hdfe[2,1] = e(se_effect_1)
.     matrix results_hdfe[3,1] = e(placebo_1)
.     matrix results_hdfe[4,1] = e(placebo_2)
.     matrix results_hdfe[5,1] = 1
. }

. else {
.     di as error "HDFE approach failed with error code: " _rc
.     matrix results_hdfe[5,1] = 0
. }

. 
. *****************************************************************************
> ***
. * 5. Test with multiple HDFE variables
. *****************************************************************************
> ***
. 
. di ""


. di "=========================================="
==========================================

. di "TEST 3: HDFE with multiple variables"
TEST 3: HDFE with multiple variables

. di "Using hdfe(industry region)"
Using hdfe(industry region)

. di "=========================================="
==========================================

. 
. timer clear 3

. timer on 3

. 
. cap noi did_multiplegt_dyn Y group time D, effects(3) placebo(2) hdfe(industr
> y region) cluster(group) graph_off
Warning: HDFE residualization could not be performed for baseline treatment lev
> el 1. Using original outcome.

High-dimensional fixed effects absorbed using reghdfe for variables: industry r
> egion



-------------------------------------------------------------------------------
> -
             Estimation of treatment effects: Event-study effects
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
    Effect_1 |  2.531353   .0819844   2.370667    2.69204       2768 
    Effect_2 |  2.552059   .0837743   2.387864   2.716254       2313 
    Effect_3 |  2.403033   .0969697   2.212976    2.59309       1888 

             | Switchers 
-------------+----------
    Effect_1 |       350 
    Effect_2 |       311 
    Effect_3 |       274 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the effects : p-value = 0


-------------------------------------------------------------------------------
> -
               Average cumulative (total) effect per treatment unit
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
  Av_tot_eff |  2.500636    .071794   2.359923    2.64135       3353 

             |    Switch  x Periods 
-------------+---------------------
  Av_tot_eff |       935            
-------------------------------------------------------------------------------
> -
Average number of time periods over which a treatment's effect is accumulated =
>  1.9187166


-------------------------------------------------------------------------------
> -
          Testing the parallel trends and no anticipation assumptions
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
   Placebo_1 |  .0743222   .0811303  -.0846904   .2333348       2308 
   Placebo_2 | -.0234486   .0990029  -.2174908   .1705936       1500 

             | Switchers 
-------------+----------
   Placebo_1 |       306 
   Placebo_2 |       239 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the placebos : p-value = .57983819


The development of this package was funded by the European Union (ERC, REALLYCR
> EDIBLE,GA N°101043899).

. 
. timer off 3

. timer list 3
   3:      0.74 /        1 =       0.7380

. 
. matrix results_hdfe2 = J(5,1,.)

. if _rc == 0 {
.     matrix results_hdfe2[1,1] = e(effect_1)
.     matrix results_hdfe2[2,1] = e(se_effect_1)
.     matrix results_hdfe2[3,1] = e(placebo_1)
.     matrix results_hdfe2[4,1] = e(placebo_2)
.     matrix results_hdfe2[5,1] = 1
. }

. else {
.     di as error "HDFE approach with multiple vars failed: " _rc
.     matrix results_hdfe2[5,1] = 0
. }

. 
. *****************************************************************************
> ***
. * 6. Baseline comparison (no controls, no hdfe)
. *****************************************************************************
> ***
. 
. di ""


. di "=========================================="
==========================================

. di "TEST 4: BASELINE (no controls, no hdfe)"
TEST 4: BASELINE (no controls, no hdfe)

. di "=========================================="
==========================================

. 
. timer clear 4

. timer on 4

. 
. cap noi did_multiplegt_dyn Y group time D, effects(3) placebo(2) cluster(grou
> p) graph_off


-------------------------------------------------------------------------------
> -
             Estimation of treatment effects: Event-study effects
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
    Effect_1 |  2.531353   .0819844   2.370667    2.69204       2768 
    Effect_2 |  2.552059   .0837743   2.387864   2.716254       2313 
    Effect_3 |  2.403033   .0969697   2.212976    2.59309       1888 

             | Switchers 
-------------+----------
    Effect_1 |       350 
    Effect_2 |       311 
    Effect_3 |       274 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the effects : p-value = 0


-------------------------------------------------------------------------------
> -
               Average cumulative (total) effect per treatment unit
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
  Av_tot_eff |  2.500636    .071794   2.359923    2.64135       3353 

             |    Switch  x Periods 
-------------+---------------------
  Av_tot_eff |       935            
-------------------------------------------------------------------------------
> -
Average number of time periods over which a treatment's effect is accumulated =
>  1.9187166


-------------------------------------------------------------------------------
> -
          Testing the parallel trends and no anticipation assumptions
-------------------------------------------------------------------------------
> -

             |  Estimate         SE      LB CI      UB CI          N 
-------------+-------------------------------------------------------
   Placebo_1 |  .0743222   .0811303  -.0846904   .2333348       2308 
   Placebo_2 | -.0234486   .0990029  -.2174908   .1705936       1500 

             | Switchers 
-------------+----------
   Placebo_1 |       306 
   Placebo_2 |       239 
-------------------------------------------------------------------------------
> -
Test of joint nullity of the placebos : p-value = .57983819


The development of this package was funded by the European Union (ERC, REALLYCR
> EDIBLE,GA N°101043899).

. 
. timer off 4

. timer list 4
   4:      0.70 /        1 =       0.7030

. 
. matrix results_baseline = J(5,1,.)

. if _rc == 0 {
.     matrix results_baseline[1,1] = e(effect_1)
.     matrix results_baseline[2,1] = e(se_effect_1)
.     matrix results_baseline[3,1] = e(placebo_1)
.     matrix results_baseline[4,1] = e(placebo_2)
.     matrix results_baseline[5,1] = 1
. }

. 
. *****************************************************************************
> ***
. * 7. Summary Comparison
. *****************************************************************************
> ***
. 
. di ""


. di "=========================================="
==========================================

. di "SUMMARY COMPARISON"
SUMMARY COMPARISON

. di "=========================================="
==========================================

. di ""


. di "True ATT: `true_att'"
True ATT: 2.5

. di ""


. di "                      ATT        SE       Placebo1    Placebo2"
                      ATT        SE       Placebo1    Placebo2

. di "--------------------------------------------------------------"
--------------------------------------------------------------

. 
. if results_baseline[5,1] == 1 {
.     di "Baseline       " %9.4f results_baseline[1,1] %9.4f results_baseline[2
> ,1] %9.4f results_baseline[3,1] %9.4f results_baseline[4,1]
Baseline               .   0.0820        .        .
. }

. 
. if results_controls[5,1] == 1 {
.     di "Controls       " %9.4f results_controls[1,1] %9.4f results_controls[2
> ,1] %9.4f results_controls[3,1] %9.4f results_controls[4,1]
Controls               .   0.0827        .        .
. }

. 
. if results_hdfe[5,1] == 1 {
.     di "HDFE(ind)      " %9.4f results_hdfe[1,1] %9.4f results_hdfe[2,1] %9.4
> f results_hdfe[3,1] %9.4f results_hdfe[4,1]
HDFE(ind)              .   0.0820        .        .
. }

. 
. if results_hdfe2[5,1] == 1 {
.     di "HDFE(ind+reg)  " %9.4f results_hdfe2[1,1] %9.4f results_hdfe2[2,1] %9
> .4f results_hdfe2[3,1] %9.4f results_hdfe2[4,1]
HDFE(ind+reg)          .   0.0820        .        .
. }

. 
. di "--------------------------------------------------------------"
--------------------------------------------------------------

. di ""


. di "Timing comparison:"
Timing comparison:

. timer list
   1:      5.21 /        1 =       5.2050
   2:      0.88 /        1 =       0.8840
   3:      0.74 /        1 =       0.7380
   4:      0.70 /        1 =       0.7030

. 
. di ""


. di "=========================================="
==========================================

. di "TEST COMPLETED"
TEST COMPLETED

. di "=========================================="
==========================================

. 
end of do-file
